---
kind: method
id: M:Autodesk.Revit.DB.Outline.#ctor(Autodesk.Revit.DB.Outline)
source: html/173fe602-1227-907f-a555-eec914b25009.htm
---
# Autodesk.Revit.DB.Outline.#ctor Method

Constructs a new copy of the input Outline object.

## Syntax (C#)
```csharp
public Outline(
	Outline other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Outline`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration